"""
【问题描述】矩阵A，B，规模都为4*4。A的第一行全为1，第二行全为2，第三行全为3，第四行全为4，B的第一行全为4，第二行全为3，第三行全为2，第四行全为1。求A*B
【输入形式】无。
【输出形式】输出四行。每一行对应结果矩阵的一行。行内元素之间用１个空格隔开。
"""
A = [[1, 1, 1, 1],
     [2, 2, 2, 2],
     [3, 3, 3, 3],
     [4, 4, 4, 4]]
B = [[4, 4, 4, 4],
     [3, 3, 3, 3],
     [2, 2, 2, 2],
     [1, 1, 1, 1]]
result = []
for i in range(4):
    C = []
    for j in range(4):
        C.append(A[i][0] * B[0][j] + A[i][1] * B[1][j] + A[i][2] * B[2][j] + A[i][3] * B[3][j])
    result.append(C)
for i in range(4):
    for n in result[i]:
        print(n, end = " ")
    print(" ")